app/controllers/flashcards_controller.rb

SELECT "flashcards".* FROM "flashcards" INNER JOIN "myflashcards" ON "flashcards"."id" = "myflashcards"."flashcard_id" WHERE "myflashcards"."user_id" = $1  [["user_id", 14]]
---
  def index
    @flashcards = current_user.flashcards.all

INSERT INTO "flashcards" ("word", "definition", "sentence", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["word", "h"], ["definition", "h"], ["sentence", "h"], ["user_id", 2], ["created_at", "2018-08-30 20:26:15.653983"], ["updated_at", "2018-08-30 20:26:15.653983"]]
---
  def create
    @flashcard = current_user.flashcards.build(flashcard_params)

    if @flashcard.save

UPDATE "flashcards" SET "word" = $1, "definition" = $2, "sentence" = $3, "updated_at" = $4 WHERE "flashcards"."id" = $5  [["word", "hi"], ["definition", ""], ["sentence", "hi"], ["updated_at", "2018-08-30 19:07:48.129788"], ["id", 1]]
---
  def update
    if @flashcard.update(flashcard_params)

DELETE FROM "flashcards" WHERE "flashcards"."id" = $1  [["id", 1]]
---
  def destroy
    @flashcard.delete

SELECT  "flashcards".* FROM "flashcards" WHERE "flashcards"."user_id" = $1 AND "flashcards"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
---
  def set_flashcard
    @flashcard = current_user.flashcards.find(params[:id])