app/controllers/myflashcards_controller.rb

SELECT "myflashcards".* FROM "myflashcards" WHERE "myflashcards"."user_id" = $1  [["user_id", 9]]
---
  def index
    @myflashcards = current_user.myflashcards.all

INSERT INTO "myflashcards" ("user_id", "flashcard_id", "sentence", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 9], ["flashcard_id", 1], ["sentence", "hi"], ["created_at", "2018-08-31 19:54:25.956288"], ["updated_at", "2018-08-31 19:54:25.956288"]]
---
  def create
    @myflashcard = current_user.myflashcards.build(myflashcard_params)

    if @myflashcard.save

UPDATE "myflashcards" SET "sentence" = $1, "updated_at" = $2 WHERE "myflashcards"."id" = $3  [["sentence", "hi"], ["updated_at", "2018-08-31 20:05:16.511959"], ["id", 4]]
---
  def update
    if @myflashcard.update(myflashcard_params)

DELETE FROM "myflashcards" WHERE "myflashcards"."id" = $1  [["id", 4]]
---
  def destroy
    @myflashcard.destroy

SELECT  "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "myflashcards".* FROM "myflashcards" WHERE "myflashcards"."user_id" = $1 AND "myflashcards"."id" = $2 LIMIT $3  [["user_id", 9], ["id", 4], ["LIMIT", 1]]
---
    def set_myflashcard
      @myflashcard = current_user.myflashcards.find(params[:id])